# Install applications
cask '1password'
cask 'brave-browser'
cask 'cleanshot'
cask 'discord'
cask 'figma'
cask 'firefox'
cask 'font-fira-code'
cask 'google-chrome'
cask 'google-drive'
cask 'iterm2'
cask 'karabiner-elements'
cask 'kitty'
cask 'linear-linear'
cask 'raycast'
cask 'signal'
cask 'slack'
cask 'spotify'
cask 'todoist'
cask 'visual-studio-code'
cask 'whatsapp'

# Install libraries
brew 'aom'
brew 'apr'
brew 'apr-util'
brew 'argon2'
brew 'aspell'
brew 'autoconf'
brew 'bash'
brew 'bash-completion@2'
brew 'bat'
brew 'berkeley-db@5'
brew 'brotli'
brew 'ca-certificates'
brew 'cmake'
brew 'coreutils'
brew 'curl'
brew 'diff-so-fancy'
brew 'docbook'
brew 'docbook-xsl'
brew 'fd'
brew 'findutils'
brew 'freetype'
brew 'fzf'
brew 'gd'
brew 'gdbm'
brew 'gettext'
brew 'gh'
brew 'ghostscript'
brew 'giflib'
brew 'git'
brew 'git-quick-stats'
brew 'glib'
brew 'gmp'
brew 'gnu-getopt'
brew 'grep'
brew 'highway'
brew 'htop'
brew 'icu4c'
brew 'imagemagick'
brew 'imath'
brew 'jasper'
brew 'jbig2dec'
brew 'jpeg-turbo'
brew 'jpeg-xl'
brew 'jq'
brew 'krb5'
brew 'ldns'
brew 'libavif'
brew 'libcbor'
brew 'libde265'
brew 'libevent'
brew 'libfido2'
brew 'libgit2'
brew 'libheif'
brew 'libidn'
brew 'libidn2'
brew 'liblqr'
brew 'libnghttp2'
brew 'libomp'
brew 'libpng'
brew 'libpq'
brew 'python-tabulate'
brew 'libraw'
brew 'libsodium'
brew 'libssh2'
brew 'libtermkey'
brew 'libtiff'
brew 'libtool'
brew 'libunistring'
brew 'libuv'
brew 'libvmaf'
brew 'libvterm'
brew 'libzip'
brew 'little-cms2'
brew 'lua'
brew 'luajit'
brew 'luarocks'
brew 'luv'
brew 'lz4'
brew 'm4'
brew 'moreutils'
brew 'mpdecimal'
brew 'msgpack'
brew 'mysql-client'
brew 'ncurses'
brew 'neovim'
brew 'oniguruma'
brew 'openexr'
brew 'openjpeg'
brew 'openldap'
brew 'openssh'
brew 'openssl@1.1'
brew 'openssl@3'
brew 'pandoc'
brew 'pcre2'
brew 'perl'
brew 'pgcli'
brew 'php'
brew 'postgresql@16'
brew 'pscale'
brew 'puma-dev'
brew 'pygments'
brew 'python-tabulate'
brew 'python-typing-extensions'
brew 'python@3.12'
brew 'readline'
brew 'ripgrep'
brew 'rtmpdump'
brew 'screen'
brew 'shared-mime-info'
brew 'six'
brew 'sqlite'
brew 'switchaudio-osx'
brew 'terminal-notifier'
brew 'tidy-html5'
brew 'tldr'
brew 'tmux'
brew 'tree'
brew 'tree-sitter'
brew 'unibilium'
brew 'unixodbc'
brew 'utf8proc'
brew 'webp'
brew 'wget'
brew 'x265'
brew 'xmlto'
brew 'xz'
brew 'zlib'
brew 'zstd'
